Процедура ВыполнитьЗапрос()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Наименование КАК Наименование,
		|	СУММА(Остатки.КоличествоОстаток) КАК Количество
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК Остатки
		|		ПО Остатки.Номенклатура = Номенклатура.Ссылка
		|ГДЕ
		|	Номенклатура.ДатаСоздания >= &ДатаНачала
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура.Ссылка,
		|	Номенклатура.Наименование";
	Результат = Запрос.Выполнить();
КонецПроцедуры
